Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresInfo.GetPluginsFolder Method
 Returns main TS plugins folder, not extensions folder
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetPluginsFolder()
Public Shared Function GetPluginsFolder As String
Return Value
Type: String
plugins folder
See Also
Reference
TeklaStructuresInfo Class
Tekla.Structures Namespace